# HostId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..HostId Property
FabricArea Class See Also
---
The id of the Host element for the fabric area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId HostId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostId {
	ElementId^ get ();
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace